app/controllers/docs_controller.rb

  def index
    @docs = Doc.where(user_id: current_user)
---
SELECT "docs".* FROM "docs" WHERE "docs"."user_id" IS NULL

  def create
    @doc = current_user.docs.build(doc_params)

    if @doc.save
---
INSERT INTO "docs" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "doc 4"], ["content", "testing doc"], ["user_id", 1], ["created_at", "2016-03-26 14:41:26.735611"], ["updated_at", "2016-03-26 14:41:26.735611"]]

  def destroy
    @doc.destroy
---
DELETE FROM "docs" WHERE "docs"."id" = ?  [["id", 2]]